_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ДоговорССубподрядчиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ДоговорССубподрядчиком</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ГрафикДвиженийПоДоговору</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_ВыполнениеРаботСубподрядчиком</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_РасширенныйГрафикДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВведенПодчиненныйГрафик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСДР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗаказчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПонижающийКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикДвиженияПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДоходРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриемРабот</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриемРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУдержаниеОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтогоОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_Аванс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_Аванс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ДоговорССубподрядчиком/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		НаправлениеДеятельности = ДокументУтверждения.НаправлениеДеятельности;
	КонецЕсли; 
	
	ДатаДоговора = Договор.Дата;
	НомерДоговора = Договор.Номер;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	ПроверитьВхождениеРаботВДоговораССубподрядчиком(Отказ);
	ПроверитьОбъемРабот(Отказ);
	КонецЕсли;

	СуммаДокумента = ПолучитьСуммуДокумента();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.УСОERP_ДоговорССубподрядчиком.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Если Статус = Перечисления.СтатусыПланов.Утвержден Тогда
		
		ПроверитьНаДубликаты(Отказ);
		
		УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияВыполнениеРаботСубподрядчиком(ДополнительныеСвойства, Движения, Отказ);
		ОтразитьДвижения_ГрафикДвиженийПоДоговору(ДополнительныеСвойства, Движения, Отказ);
		ВзаиморасчетыСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
		
	КонецЕсли;
	
	СформироватьСписокРегистровДляКонтроля(); 
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);    
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНаДубликаты(Отказ)
	
	Запрос = Новый Запрос;	

	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_ДоговорССубподрядчикомРаботы.Работа КАК Работа,
	|	УСОERP_ДоговорССубподрядчикомРаботы.Работа.КодСДР КАК КодСДР,
	|	УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка КАК Ссылка,
	|	УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка.Номер КАК Номер,
	|	УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.УСОERP_ДоговорССубподрядчиком.Работы КАК УСОERP_ДоговорССубподрядчикомРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ДоговорССубподрядчиком.Работы КАК УСОERP_ДоговорССубподрядчикомРаботы1
	|		ПО УСОERP_ДоговорССубподрядчикомРаботы.Работа.РаботаИсточник = УСОERP_ДоговорССубподрядчикомРаботы1.Работа.РаботаИсточник
	|			И УСОERP_ДоговорССубподрядчикомРаботы.Ссылка.Договор = УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка.Договор
	|ГДЕ
	|	УСОERP_ДоговорССубподрядчикомРаботы.Ссылка = &Ссылка
	|	И УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка.Проведен
	|	И УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|	И УСОERP_ДоговорССубподрядчикомРаботы1.Ссылка.Ссылка <> &Ссылка
	|	И НЕ УСОERP_ДоговорССубподрядчикомРаботы.Работа.СуммарнаяРабота";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По работе "+Выборка.Работа+"("+Выборка.КодСДР+") уже есть утвержденный документ (№ "+Выборка.Номер+" от "+Выборка.Дата+")",,,,Отказ);
			
	КонецЦикла; 	
	
КонецФункции  

#КонецОбласти

#Область ОбработчикиДвиженийДокумента

Процедура ОтразитьДвижения_ГрафикДвиженийПоДоговору(ДополнительныеСвойства, Движения, Отказ)
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГрафикДвиженийПоДоговору;
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияГрафик = Движения.УСОERP_ГрафикДвиженийПоДоговору;
	ДвиженияГрафик.Записывать = Истина;
	ДвиженияГрафик.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ОтразитьДвижения_РегистрНакопленияРасчеты(ДополнительныеСвойства, Движения, Отказ)
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРегистрНакопленияРасчеты;
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
		ИЛИ Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
		ДвиженияГрафик = Движения.РасчетыСПоставщиками;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДвиженияГрафик.Записывать = Истина;
	ДвиженияГрафик.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДатыЗаполнены = Истина;
	
	Если НЕ ИспользоватьПонижающийКоэффициент Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПонижающийКоэффициент"));
		
	КонецЕсли;
	
	
	Для каждого Строка  Из ГрафикДвиженияПоДоговору  Цикл
		
		ДатыЗаполнены = ЗначениеЗаполнено(Строка.ДатаСобытия)
						ИЛИ ЗначениеЗаполнено(Строка.ДатаАванс)
						ИЛИ ЗначениеЗаполнено(Строка.ДатаПриемРабот)
						ИЛИ ЗначениеЗаполнено(Строка.ДатаОстатокПлатежа)
						ИЛИ ЗначениеЗаполнено(Строка.ДатаВозвратГарантийногоУдержания);
		
	    Если Не ДатыЗаполнены Тогда
		
			Прервать;
		
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ДатыЗаполнены Тогда
		ТекстСообщения = НСтр("ru = 'Неверно заполнены даты'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
		Отказ = Истина;		
	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Инициализация

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный        = Пользователи.ТекущийПользователь(); 
	Валюта                = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта); 
	Организация          = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);

КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПолучитьСуммуДокумента()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Работы.Работа КАК Работа,
	|	Работы.СуммаСНДС КАК СуммаСНДС
	|ПОМЕСТИТЬ Работы
	|ИЗ
	|	&Работы КАК Работы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Работы.СуммаСНДС), 0) КАК СуммаСНДС
	|ИЗ
	|	Работы КАК Работы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
	|		ПО Работы.Работа = СтроительныеРаботы.Ссылка
	|ГДЕ
	|	НЕ СтроительныеРаботы.СуммарнаяРабота");
	
	Запрос.УстановитьПараметр("Работы", Работы.Выгрузить(,"Работа,СуммаСНДС"));	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаИтого = Выгрузка[0].СуммаСНДС;
	Возврат СуммаИтого;
	
КонецФункции

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	
 	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ПроверитьВхождениеРаботВДоговораССубподрядчиком(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_ДоговорССубподрядчикомРаботы.НомерСтроки,
	|	УСОERP_ДоговорССубподрядчикомРаботы.КодСДР,
	|	ВЫРАЗИТЬ(УСОERP_ДоговорССубподрядчикомРаботы.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа
	|ПОМЕСТИТЬ ВТ_РаботыДокумента
	|ИЗ
	|	&Работы КАК УСОERP_ДоговорССубподрядчикомРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Регистратор,
	|	ВТ_РаботыДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_РаботыДокумента.КодСДР,
	|	ВТ_РаботыДокумента.Работа КАК Работа,
	|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа КАК Работа1
	|ИЗ
	|	ВТ_РаботыДокумента КАК ВТ_РаботыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком.Обороты(
	|				,
	|				,
	|				Авто,
	|				Работа В
	|						(ВЫБРАТЬ
	|							ВТ_РаботыДокумента.Работа
	|						ИЗ
	|							ВТ_РаботыДокумента КАК ВТ_РаботыДокумента)
	|					И Организация = &Организация) КАК УСОERP_ВыполнениеРаботСубподрядчикомОбороты
	|		ПО ВТ_РаботыДокумента.Работа = УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа
	|ГДЕ
	|	ЕСТЬNULL(УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа, ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|	И УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком
	|	И УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Регистратор <> &Ссылка
	|	И ВТ_РаботыДокумента.Работа.СуммарнаяРабота
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Регистратор.Дата,
	|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Регистратор.Номер
	|ИТОГИ ПО
	|	Работа";
	Запрос.УстановитьПараметр("Работы", Работы.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаРабота = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРабота.Следующий() Цикл
		
		СтрокаДокументов = "";
		Выборка = ВыборкаРабота.Выбрать();
		КодСДР = "";
		Пока Выборка.Следующий() Цикл
			Если СтрокаДокументов = "" Тогда
				СтрокаДокументов = СтрокаДокументов + Выборка.Регистратор;
			Иначе
				СтрокаДокументов = СтрокаДокументов + ", " + Символы.ПС + Выборка.Регистратор;
			КонецЕсли;
			КодСДР = Выборка.КодСДР;
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для работы " + СокрЛП(КодСДР) + " " +
					СокрЛП(ВыборкаРабота.Работа) + " уже есть созданный договор с субподрядчиком: " +
					СокрЛП(СтрокаДокументов));
								
	КонецЦикла;
	Отказ = Истина;
	
КонецПроцедуры

Процедура ПроверитьОбъемРабот(Отказ)
	
	Запрос = Новый Запрос;

	Если ДокументУтверждения.СценарийПланирования.НовыйВариант Тогда
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_ДоговорССубподрядчикомРаботы.НомерСтроки КАК НомерСтроки,
	|	УСОERP_ДоговорССубподрядчикомРаботы.КодСДР КАК КодСДР,
	|	ВЫРАЗИТЬ(УСОERP_ДоговорССубподрядчикомРаботы.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
	|	УСОERP_ДоговорССубподрядчикомРаботы.Объем КАК Объем,
	|	УСОERP_ДоговорССубподрядчикомРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема
	|ПОМЕСТИТЬ ВТ_РаботыДокумента
	|ИЗ
	|	&Работы КАК УСОERP_ДоговорССубподрядчикомРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаботыДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_РаботыДокумента.КодСДР КАК КодСДР,
	|	ВТ_РаботыДокумента.Работа КАК Работа,
	|	ВТ_РаботыДокумента.Объем КАК Объем,
	|	ВТ_РаботыДокумента.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ВТ_РаботыДокумента.Работа.ОбъемРаботы КАК ОбъемПлан
	|ИЗ
	|	ВТ_РаботыДокумента КАК ВТ_РаботыДокумента
	|ГДЕ
	|	ВТ_РаботыДокумента.Объем > ВТ_РаботыДокумента.Работа.ОбъемРаботы
	|	И НЕ ВТ_РаботыДокумента.Работа.СуммарнаяРабота
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки"; 
		
		
	Иначе
		
	
		Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_ДоговорССубподрядчикомРаботы.НомерСтроки,
	|	УСОERP_ДоговорССубподрядчикомРаботы.КодСДР,
	|	УСОERP_ДоговорССубподрядчикомРаботы.Работа,
	|	УСОERP_ДоговорССубподрядчикомРаботы.Объем,
	|	УСОERP_ДоговорССубподрядчикомРаботы.ЕдиницаОбъема
	|ПОМЕСТИТЬ ВТ_РаботыДокумента
	|ИЗ
	|	&Работы КАК УСОERP_ДоговорССубподрядчикомРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаботыДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_РаботыДокумента.КодСДР,
	|	ВТ_РаботыДокумента.Работа,
	|	ВТ_РаботыДокумента.Объем,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа КАК Работа1,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы КАК ОбъемПлан,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РаботыДокумента.Объем, 0) > ЕСТЬNULL(УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкаОбъема,
	|	ВТ_РаботыДокумента.ЕдиницаОбъема
	|ИЗ
	|	ВТ_РаботыДокумента КАК ВТ_РаботыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
	|				&КонецПериода,
	|				Работа В
	|						(ВЫБРАТЬ
	|							ВТ_РаботыДокумента.Работа
	|						ИЗ
	|							ВТ_РаботыДокумента КАК ВТ_РаботыДокумента)
	|					И Утверждена = ИСТИНА
	|					И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
	|		ПО ВТ_РаботыДокумента.Работа = УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа
	|ГДЕ
	|	ЕСТЬNULL(ВТ_РаботыДокумента.Объем, 0) > ЕСТЬNULL(УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
КонецЕсли;

	Запрос.УстановитьПараметр("Работы", Работы.Выгрузить());
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	
	Результат  = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для работы " + СокрЛП(Выборка.КодСДР) + " " +
					СокрЛП(Выборка.Работа) + " указанный объем в документе " +
					Строка(Выборка.Объем) + " " + СокрЛП(Выборка.ЕдиницаОбъема) +
					" превышает плановый утвержденный объем " +
					Строка(Выборка.ОбъемПлан) + " " + СокрЛП(Выборка.ЕдиницаОбъема));

	КонецЦикла;
	Отказ = Истина;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
